testCase_fixedWallTemperature/0/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0.0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0.0;
    }

    fluid_to_bedOfSpheres
    {
        type            calculated;
        value           uniform 0.0;
    }

    tubeWall
    {
        type            calculated;
        value           uniform 0.0;
    }  
}

// ************************************************************************* //
