testCase_fixedWallTemperature/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField     uniform 300;

boundaryField
{
    inlet
    {
	type  		fixedValue;
	value		uniform 300;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    tubeWall
    {
        type            slip;
    }
 
    fluid_to_bedOfSpheres
    {
	type		fixedValue;
	value		uniform 400;
	
// 	type            compressible::turbulentTemperatureCoupledBaffleMixed;
// 	value           uniform 400;
// 	Tnbr            T;
// 	kappa           fluidThermo;
// 	kappaName       none;
    }
}   

// ************************************************************************* //
